docs/corners/david/20200925082542-attention.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-10-31 Sun 12:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Attention</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Taproot" />
<link rel="stylesheet" href="/global.css" type="text/css"/>
<link rel="stylesheet" href="/admonition.css" type="text/css"/>

</head>
<body>
<div id="preamble" class="status">
<div class="header"><span class="site"><a href="https://taproot3.sanity.gq">TR3.5</a></span></div><div class="datarow"><h1 class="title">Attention</h1> <h2 class="subtitle"></h2> <span class="author">Taproot</span> <span class="date">2021-10-31 Sun 12:33</date></div>
</div>
<div id="content">
<div id="linktables"><div id="table-of-backlinks"><h2>Backlinks</h2><ul><li><a class='backlink' href='20200925082551-transformers.html'>Transformers</a></li> <li><a class='backlink' href='ml-index.html'>ML Index</a></li> </ul></div><div id="table-of-contents"><h2>Table of Contents</h2><div id="text-table-of-contents">
<ul>
<li><a href="#org9bb16e2">1. Overview</a></li>
<li><a href="#org6f40787">2. Calculation</a></li>
<li><a href="#org49fcec2">3. Multi-Headed Attention</a></li>
<li><a href="#org9caddf4">4. Positional Encodings</a></li>
</ul>
</div></div>
</div>

<div id="outline-container-org9bb16e2" class="outline-2">
<h2 id="org9bb16e2"><span class="section-number-2">1</span> Overview</h2>
<div class="outline-text-2" id="text-1">
<p>
Attention is a process for interpreting context of inputs, something computers and networks aren't usually great at (see interpreting sentences like "The animal was tired so <span class="underline">it</span> didn't cross the road" and understanding the "it"). 
</p>

<p>
Attention (in the context of NLP) allows better encoding of words by looking at the rest of the words in the sentence so that machines can understand context. 
</p>
</div>
</div>

<div id="outline-container-org6f40787" class="outline-2">
<h2 id="org6f40787"><span class="section-number-2">2</span> Calculation</h2>
<div class="outline-text-2" id="text-2">
<p>
To begin, we calculate query, key, and value vectors by multiplying the word embeddings (vector representations of words) by weight matrices <i>Note: Where the hell do these come from? Ask Jack?</i>.
Then we calculate an attention score by multiplying query by key, dividing by the squareroot of the key vector dimensionality (a trick to help with gradients), take softmax, and finally multiply by value vector.
</p>

<p>
Alternatively this can be represented by \(Z = \text{softmax}(\frac{Q \cdot K^T}{\sqrt{d_k}}) V\), where \(Z\) is the attention output.
Calculation of the key/value/query vectors and their involvement is intuitive to some degree because the weights should signify importance of words, etc.
</p>
</div>
</div>


<div id="outline-container-org49fcec2" class="outline-2">
<h2 id="org49fcec2"><span class="section-number-2">3</span> Multi-Headed Attention</h2>
<div class="outline-text-2" id="text-3">
<p>
Different version of attention with even more weird representations like query/key/value.
</p>
</div>
</div>

<div id="outline-container-org9caddf4" class="outline-2">
<h2 id="org9caddf4"><span class="section-number-2">4</span> Positional Encodings</h2>
<div class="outline-text-2" id="text-4">
<p>
Positional encodings, vectors representing where the word is in the sentence are added to the original word embedding to allow a notion of time/position in the encoding process.
</p>
</div>
</div>
</div>
</body>
</html>
